zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxHspdm_bf.h
/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M0S */
#define IFX_HSPDM_FLAGS_M0S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M0S */
#define IFX_HSPDM_FLAGS_M0S_OFF (4u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M0E */
#define IFX_HSPDM_FLAGS_M0E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M0E */
#define IFX_HSPDM_FLAGS_M0E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M0E */
#define IFX_HSPDM_FLAGS_M0E_OFF (5u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M1S */
#define IFX_HSPDM_FLAGS_M1S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M1S */
#define IFX_HSPDM_FLAGS_M1S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M1S */
#define IFX_HSPDM_FLAGS_M1S_OFF (6u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.M1E */
#define IFX_HSPDM_FLAGS_M1E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.M1E */
#define IFX_HSPDM_FLAGS_M1E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.M1E */
#define IFX_HSPDM_FLAGS_M1E_OFF (7u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.ER */
#define IFX_HSPDM_FLAGS_ER_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.ER */
#define IFX_HSPDM_FLAGS_ER_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.ER */
#define IFX_HSPDM_FLAGS_ER_OFF (8u)

/** \brief Length for Ifx_HSPDM_FLAGS_Bits.MUTE */
#define IFX_HSPDM_FLAGS_MUTE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGS_Bits.MUTE */
#define IFX_HSPDM_FLAGS_MUTE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGS_Bits.MUTE */
#define IFX_HSPDM_FLAGS_MUTE_OFF (9u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.BAS */
#define IFX_HSPDM_FLAGSSET_BAS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.BAS */
#define IFX_HSPDM_FLAGSSET_BAS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.BAS */
#define IFX_HSPDM_FLAGSSET_BAS_OFF (0u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.BAE */
#define IFX_HSPDM_FLAGSSET_BAE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.BAE */
#define IFX_HSPDM_FLAGSSET_BAE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.BAE */
#define IFX_HSPDM_FLAGSSET_BAE_OFF (1u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.BBS */
#define IFX_HSPDM_FLAGSSET_BBS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.BBS */
#define IFX_HSPDM_FLAGSSET_BBS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.BBS */
#define IFX_HSPDM_FLAGSSET_BBS_OFF (2u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.BBE */
#define IFX_HSPDM_FLAGSSET_BBE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.BBE */
#define IFX_HSPDM_FLAGSSET_BBE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.BBE */
#define IFX_HSPDM_FLAGSSET_BBE_OFF (3u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.M0S */
#define IFX_HSPDM_FLAGSSET_M0S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.M0S */
#define IFX_HSPDM_FLAGSSET_M0S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.M0S */
#define IFX_HSPDM_FLAGSSET_M0S_OFF (4u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.M0E */
#define IFX_HSPDM_FLAGSSET_M0E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.M0E */
#define IFX_HSPDM_FLAGSSET_M0E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.M0E */
#define IFX_HSPDM_FLAGSSET_M0E_OFF (5u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.M1S */
#define IFX_HSPDM_FLAGSSET_M1S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.M1S */
#define IFX_HSPDM_FLAGSSET_M1S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.M1S */
#define IFX_HSPDM_FLAGSSET_M1S_OFF (6u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.M1E */
#define IFX_HSPDM_FLAGSSET_M1E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.M1E */
#define IFX_HSPDM_FLAGSSET_M1E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.M1E */
#define IFX_HSPDM_FLAGSSET_M1E_OFF (7u)

/** \brief Length for Ifx_HSPDM_FLAGSSET_Bits.ER */
#define IFX_HSPDM_FLAGSSET_ER_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSSET_Bits.ER */
#define IFX_HSPDM_FLAGSSET_ER_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSSET_Bits.ER */
#define IFX_HSPDM_FLAGSSET_ER_OFF (8u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.BAS */
#define IFX_HSPDM_FLAGSCLEAR_BAS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.BAS */
#define IFX_HSPDM_FLAGSCLEAR_BAS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.BAS */
#define IFX_HSPDM_FLAGSCLEAR_BAS_OFF (0u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.BAE */
#define IFX_HSPDM_FLAGSCLEAR_BAE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.BAE */
#define IFX_HSPDM_FLAGSCLEAR_BAE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.BAE */
#define IFX_HSPDM_FLAGSCLEAR_BAE_OFF (1u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.BBS */
#define IFX_HSPDM_FLAGSCLEAR_BBS_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.BBS */
#define IFX_HSPDM_FLAGSCLEAR_BBS_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.BBS */
#define IFX_HSPDM_FLAGSCLEAR_BBS_OFF (2u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.BBE */
#define IFX_HSPDM_FLAGSCLEAR_BBE_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.BBE */
#define IFX_HSPDM_FLAGSCLEAR_BBE_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.BBE */
#define IFX_HSPDM_FLAGSCLEAR_BBE_OFF (3u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.M0S */
#define IFX_HSPDM_FLAGSCLEAR_M0S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.M0S */
#define IFX_HSPDM_FLAGSCLEAR_M0S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.M0S */
#define IFX_HSPDM_FLAGSCLEAR_M0S_OFF (4u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.M0E */
#define IFX_HSPDM_FLAGSCLEAR_M0E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.M0E */
#define IFX_HSPDM_FLAGSCLEAR_M0E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.M0E */
#define IFX_HSPDM_FLAGSCLEAR_M0E_OFF (5u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.M1S */
#define IFX_HSPDM_FLAGSCLEAR_M1S_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.M1S */
#define IFX_HSPDM_FLAGSCLEAR_M1S_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.M1S */
#define IFX_HSPDM_FLAGSCLEAR_M1S_OFF (6u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.M1E */
#define IFX_HSPDM_FLAGSCLEAR_M1E_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.M1E */
#define IFX_HSPDM_FLAGSCLEAR_M1E_MSK (0x1u)

/** \brief Offset for Ifx_HSPDM_FLAGSCLEAR_Bits.M1E */
#define IFX_HSPDM_FLAGSCLEAR_M1E_OFF (7u)

/** \brief Length for Ifx_HSPDM_FLAGSCLEAR_Bits.ER */
#define IFX_HSPDM_FLAGSCLEAR_ER_LEN (1u)

/** \brief Mask for Ifx_HSPDM_FLAGSCLEAR_Bits.ER */
#define IFX_HSPDM_FLAGSCLEAR_ER_MSK (0x1u)

